src/tool/asic-verifier-cli/src/test/resources/asic-containers/invalid-signed-hashchain/message.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:id="http://x-road.eu/xsd/identifiers"
    xmlns:xroad="http://x-road.eu/xsd/xroad.xsd">
    <SOAP-ENV:Header>
        <xroad:client id:objectType="SUBSYSTEM">
            <id:xRoadInstance>DEV</id:xRoadInstance>
            <id:memberClass>COM</id:memberClass>
            <id:memberCode>4321</id:memberCode>
            <id:subsystemCode>TestClient</id:subsystemCode>
        </xroad:client>
        <xroad:service id:objectType="SERVICE">
            <id:xRoadInstance>DEV</id:xRoadInstance>
            <id:memberClass>COM</id:memberClass>
            <id:memberCode>1234</id:memberCode>
            <id:subsystemCode>TestService</id:subsystemCode>
            <id:serviceCode>storeAttachments</id:serviceCode>
            <id:serviceVersion>v1</id:serviceVersion>
        </xroad:service>
        <xroad:id>6354aea4-1f3e-4354-ad39-666f76e438c8</xroad:id>
        <xroad:protocolVersion>4.0</xroad:protocolVersion>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <prod:storeAttachments xmlns:prod="http://test.x-road.global/producer"/>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
